/********************************************************************************/
/* File Name			: Common.h												*/
/* Description			: 共通定義												*/
/********************************************************************************/
#ifndef _LEPTRINO_COMMON_H
#define _LEPTRINO_COMMON_H

/********************************************************************************/
/*	変数型定義 																	*/
/********************************************************************************/
typedef unsigned char UCHAR;
typedef signed char SCHAR;
typedef unsigned short USHORT;
typedef signed short SSHORT;
typedef unsigned long ULONG;
typedef signed long SLONG;

/********************************************************************************/
/*	定数定義 																	*/
/********************************************************************************/
#define OK	1
#define NG	-1

#define SERIAL_SIZE		8			/* 製品シリアルサイズ */
#define P_NAME_SIZE		16			/* 製品型式サイズ */
#define F_VER_SIZE		4			/* ファームバージョンサイズ */
#define FREQ_SIZE		6			/* 出力レート */

#define MSG_SIZE		128			/* 電文サイズ */

/********************************************************************************/
/*	マクロ 																		*/
/********************************************************************************/

/********************************************************************************/
/*	列挙型定義 																	*/
/********************************************************************************/
/* 力要素番号 */
enum ForceNo
{
  FN_Fx = 0,
  FN_Fy,
  FN_Fz,
  FN_Mx,
  FN_My,
  FN_Mz,
  FN_Num
};

#endif
/************************* (C) COPYRIGHT 2010 Leptrino **************************/
